In [1]:
#Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 

train  = pd.read_csv("aug_train.csv")
train.head()

test  = pd.read_csv("aug_test.csv")
test.head()

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_type,last_new_job,training_hours,target
0,0.624,NaN,Has relevent experience,Full time course,Graduate,Other,3,Pvt Ltd,1,134,0
1,0.920,Female,No relevent experience,no_enrollment,Graduate,STEM,5,Early Stage Startup,1,34,1
2,0.767,NaN,Has relevent experience,Full time course,Graduate,STEM,10,Pvt Ltd,2,90,0
3,0.910,Male,No relevent experience,NaN,High School,NaN,10,NaN,never,42,0
4,0.624,Male,Has relevent experience,Part time course,Graduate,STEM,3,Pvt Ltd,1,198,0

In [14]:
#Task1 Data clean, imputation

#1. in experience, replace >20 to 21; <1 to 1, and convert this as a numerical column
train.loc[train["experience"] == ">20", "experience"] = 21
train.loc[train["experience"] == "<1", "experience"] = 1
train.tail()

test.loc[test["experience"] == ">20", "experience"] = 21
test.loc[test["experience"] == "<1", "experience"] = 1

test["experience"] = pd.to_numeric(test["experience"])
train["experience"] = pd.to_numeric(train["experience"])

#train["experience"].describe()
#test["experience"].describe()

#2. in last_new_job, replace >4 to 5; never to 0, and convert this as a numerical column
train.loc[train["last_new_job"] == ">4", "last_new_job"] = 5
train.loc[train["last_new_job"] == "never", "last_new_job"] = 0
train["last_new_job"] = pd.to_numeric(train["last_new_job"])
#train["last_new_job"].describe()

test.loc[test["last_new_job"] == ">4", "last_new_job"] = 5
test.loc[test["last_new_job"] == "never", "last_new_job"] = 0
test["last_new_job"] = pd.to_numeric(test["last_new_job"])
test["last_new_job"].describe()

#3. If the column is categorical, impute the missing value as its mode. If the column is numerical, impute the missing value as its median

count    100.000000
mean       2.160000
std        1.779343
min        0.000000
25%        1.000000
50%        1.000000
75%        4.000000
max        5.000000
Name: last_new_job, dtype: float64